
Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.CRM_СтатусыЗаказов.Новый;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Отказ Тогда
		Возврат 
	КонецЕсли;
	
	//Rabbit MQ
	Маршрутизация = "CRM_NewOrder";
	
	//только если оплачен
    Если Статус = Перечисления.CRM_СтатусыЗаказов.Оплачен Тогда
		//Запись сообщения в очередь	
		Данные = Новый Структура;  
		Данные.Вставить("Номер", Номер); 
		Данные.Вставить("КодКонтрагента", Клиент.Код);
		Данные.Вставить("Товары",Новый Массив);
		Для каждого стр из Товары Цикл 
			НовСтрока = Новый Структура();
			НовСтрока.Вставить("КодНоменклатуры",стр.Номенклатура.Код);
			НовСтрока.Вставить("Количество",стр.Количество); 
			НовСтрока.Вставить("Сумма",стр.Сумма);
			Данные.Товары.Добавить(НовСтрока);
		КонецЦикла;
		ЗаписьJSON = Новый ЗаписьJSON; 
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,Данные);  
		Сообщение = ЗаписьJSON.Закрыть();
		
		МЗ = РегистрыСведений.CRM_ОчередьRMQ.СоздатьМенеджерЗаписи();
		МЗ.ID = новый УникальныйИдентификатор;
		МЗ.Сообщение = Сообщение;
		МЗ.Маршрутизация = Маршрутизация;
		МЗ.Записать();  
	КонецЕсли;

	
КонецПроцедуры






