
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Отказ Тогда
		Возврат 
	КонецЕсли; 
	ДополнительныеСвойства.Вставить("ИзмененныеОстаткиНоменклатуры",Новый Массив);
	Для каждого Стр из ЭтотОбъект Цикл
		ДополнительныеСвойства.ИзмененныеОстаткиНоменклатуры.Добавить(Стр.Номенклатура);		
	КонецЦикла;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Отказ Тогда
		Возврат 
	КонецЕсли;
	
	Для каждого Стр из ЭтотОбъект Цикл
		ДополнительныеСвойства.ИзмененныеОстаткиНоменклатуры.Добавить(Стр.Номенклатура);		
	КонецЦикла;
	
	//Rabbit MQ
	Маршрутизация = "CRM_remaining";
	
	//Отправляться будут только номенклатуры с Кодом CRM
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.КодCRM КАК КодCRM
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылки)
		|	И Номенклатура.КодCRM <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтНоменклатура.КодCRM КАК КодCRM,
		|	ЕСТЬNULL(СвободныеОстаткиОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток
		|ИЗ
		|	ВтНоменклатура КАК ВтНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(
		|				,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ВтНоменклатура.Ссылка КАК Ссылка
		|					ИЗ
		|						ВтНоменклатура КАК ВтНоменклатура)) КАК СвободныеОстаткиОстатки
		|		ПО ВтНоменклатура.Ссылка = СвободныеОстаткиОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылки", ДополнительныеСвойства.ИзмененныеОстаткиНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		//Запись сообщения в очередь
		
		Данные = Новый Структура;  
	    Данные.Вставить("КодCRM", Выборка.КодCRM); 
		Данные.Вставить("СвободныйОстаток", Выборка.СвободныйОстаток);
		ЗаписьJSON = Новый ЗаписьJSON; 
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON,Данные);  
	    Сообщение = ЗаписьJSON.Закрыть();
		
		МЗ = РегистрыСведений.ОчередьRMQ.СоздатьМенеджерЗаписи();
		МЗ.ID = новый УникальныйИдентификатор;
		МЗ.Сообщение = Сообщение;
		МЗ.Маршрутизация = Маршрутизация;
		МЗ.Записать();
	КонецЦикла;	
	 
	
КонецПроцедуры


