
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр СвободныеОстатки Расход
	Движения.СвободныеОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Отказ Тогда
		Возврат 
	КонецЕсли;
	
	//Rabbit MQ
	Маршрутизация = "CRM_OrderStatus";
	
	//Отправляться будут только заказы с Кодом CRM
	Если ЗначениеЗаполнено(НомерCRM) Тогда
		//Запись сообщения в очередь
		
		Данные = Новый Структура;  
	    Данные.Вставить("НомерCRM", НомерCRM); 
		Данные.Вставить("Статус", XMLСтрока(Статус));
		ЗаписьJSON = Новый ЗаписьJSON; 
		ЗаписьJSON.УстановитьСтроку();
	    ЗаписатьJSON(ЗаписьJSON,Данные);  
	    Сообщение = ЗаписьJSON.Закрыть();
		
		МЗ = РегистрыСведений.ОчередьRMQ.СоздатьМенеджерЗаписи();
		МЗ.ID = новый УникальныйИдентификатор;
		МЗ.Сообщение = Сообщение;
		МЗ.Маршрутизация = Маршрутизация;
		МЗ.Записать();
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

