Функция ПолучитьНастройки(ИмяОбмена) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.CRM_ПараметрыПодключенияRMQ КАК CRM_ПараметрыПодключенияRMQ
		|ГДЕ
		|	CRM_ПараметрыПодключенияRMQ.ИмяОбмена = &ИмяОбмена";
	
	Запрос.УстановитьПараметр("ИмяОбмена", ИмяОбмена);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата = Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ИмяОчереди,ТочкаОбмена");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции